package com.solvd.task2;

public class Start {

    // Интернет-магазин (Я покупатель, хочу купить много чего,
    // сколько это будет стоить, можно ли сделать возврат,
    // можно ли купить товар за наличные/по карте/в кредит)

//    В текущий проект добавить:
//    1 - Наследование минимум двух базовых классов (у кого этого нет)
//    2 - Минимум 1 абстрактный класс и 1 абстрактный метод (у кого нет).
//    3 - Минимум 3-м классам переопределение методов - toString, hashCode, equals
//    4 - Перегрузку 1 метода (можно не использовать перегруженный метод,
//    если этого не требует логика программы)
//    5 - 1 интерфейс и реализовать его минимум в 1-м классе
//    6 - Возврат данных из void методов, если это не методы только для вывода данных в консоль и не set методы.
//    7 - Логику получения вводных данных(через консоль или рандомно)
//    +консольный интерфейс программы с выводом результата программы(в идеале это System.out.println(object), object-объект класса, в котором переопределён метод toString).
//    8 - Добавить в .gitignore все файлы кроме папки src и глубже
//    + исправить структуру у кого не так, как на скриншоте в прошлом дз.
//    9 - Избыточные static классы и методы (т.к. на данном этапе одна из главных целей
//    -научиться работать с объектами)
}
